Feature: Реєстрація та логін користувача

  Scenario: Успішна реєстрація та логін
    Given я відкриваю сторінку реєстрації "http://localhost:3000/register.html"
    When я вводжу унікальне ім'я користувача, email та пароль
    And натискаю кнопку "Register"
    Then я повинен побачити повідомлення про успішну реєстрацію

    When я відкриваю сторінку логіну "http://localhost:3000/login.html"
    And я вводжу той самий email та пароль
    And натискаю кнопку "Login"
    Then я повинен бути перенаправлений на головну сторінку або побачити повідомлення про успішний вхід
